In [1]:
#Pandas
import pandas
pandas.__version__

'0.25.1'

In [2]:
import numpy as np
import pandas as pd

In [3]:
#Series
counts = pd.Series([891, 2978, 379, 175])
counts

0     891
1    2978
2     379
3     175
dtype: int64

In [4]:
counts.values

array([ 891, 2978,  379,  175], dtype=int64)

In [5]:
counts.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
Flower = pd.Series([632, 1638, 569, 115], 
    index=['Hyacinth', 'Chrysanthemum', 'Gardenias', 'Carnations'])

Flower

Hyacinth          632
Chrysanthemum    1638
Gardenias         569
Carnations        115
dtype: int64

In [7]:
Flower['Gardenias']

569

In [8]:
Flower[0]

632

In [9]:
Flower.name = 'counts'
Flower.index.name = 'Types'
Flower

Types
Hyacinth          632
Chrysanthemum    1638
Gardenias         569
Carnations        115
Name: counts, dtype: int64

In [10]:
np.log(Flower)

Types
Hyacinth         6.448889
Chrysanthemum    7.401231
Gardenias        6.343880
Carnations       4.744932
Name: counts, dtype: float64

In [11]:
Flower[Flower>1000]

Types
Chrysanthemum    1638
Name: counts, dtype: int64

In [12]:
Flower_dict ={'Hyacinth' :  632, 'Chrysanthemum' : 1638, 'Gardenias' : 569, 'Carnations' :115}
print(Flower_dict)
pd.Series(Flower_dict)

{'Hyacinth': 632, 'Chrysanthemum': 1638, 'Gardenias': 569, 'Carnations': 115}

Hyacinth          632
Chrysanthemum    1638
Gardenias         569
Carnations        115
dtype: int64

In [13]:
#DataFrame
data = {"Province": ["FL", "FL", "NH", "NH", "ZH"],
        "Year": [2013, 2014, 2013, 2014, 2014],
        "Literacy": [0.2, 0.1, 0.5, 0.3, 0.5]}
print(data)
data = pd.DataFrame(data)
data

{'Province': ['FL', 'FL', 'NH', 'NH', 'ZH'], 'Year': [2013, 2014, 2013, 2014, 2014], 'Literacy': [0.2, 0.1, 0.5, 0.3, 0.5]}

  Province  Year  Literacy
0       FL  2013       0.2
1       FL  2014       0.1
2       NH  2013       0.5
3       NH  2014       0.3
4       ZH  2014       0.5

In [14]:
data = {"Province": ["FL", "FL", "NH", "NH", "ZH"],
        "Year": [2015, 2016, 2017, 2018, 2019],
        "Literacy": [0.3, 0.5, 0.6, 0.2, 0.8]}
print(data)
data = pd.DataFrame(data)
data

{'Province': ['FL', 'FL', 'NH', 'NH', 'ZH'], 'Year': [2015, 2016, 2017, 2018, 2019], 'Literacy': [0.3, 0.5, 0.6, 0.2, 0.8]}

  Province  Year  Literacy
0       FL  2015       0.3
1       FL  2016       0.5
2       NH  2017       0.6
3       NH  2018       0.2
4       ZH  2019       0.8

In [15]:
df = pd.DataFrame(data, columns=["Year", "Province" ,"Literacy"])
df

   Year Province  Literacy
0  2015       FL       0.3
1  2016       FL       0.5
2  2017       NH       0.6
3  2018       NH       0.2
4  2019       ZH       0.8

In [16]:
df['Blah'] = df.Year / df.Literacy
df

   Year Province  Literacy          Blah
0  2015       FL       0.3   6716.666667
1  2016       FL       0.5   4032.000000
2  2017       NH       0.6   3361.666667
3  2018       NH       0.2  10090.000000
4  2019       ZH       0.8   2523.750000

In [17]:
df['Serie_aligned'] = pd.Series(range(5), index=[0,1,2, 3, 4])
df

   Year Province  Literacy          Blah  Serie_aligned
0  2015       FL       0.3   6716.666667              0
1  2016       FL       0.5   4032.000000              1
2  2017       NH       0.6   3361.666667              2
3  2018       NH       0.2  10090.000000              3
4  2019       ZH       0.8   2523.750000              4

In [18]:
df.to_dict()

{'Year': {0: 2015, 1: 2016, 2: 2017, 3: 2018, 4: 2019},
 'Province': {0: 'FL', 1: 'FL', 2: 'NH', 3: 'NH', 4: 'ZH'},
 'Literacy': {0: 0.3, 1: 0.5, 2: 0.6, 3: 0.2, 4: 0.8},
 'Blah': {0: 6716.666666666667,
  1: 4032.0,
  2: 3361.666666666667,
  3: 10090.0,
  4: 2523.75},
 'Serie_aligned': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4}}

In [19]:
pd.DataFrame(df.to_dict())

   Year Province  Literacy          Blah  Serie_aligned
0  2015       FL       0.3   6716.666667              0
1  2016       FL       0.5   4032.000000              1
2  2017       NH       0.6   3361.666667              2
3  2018       NH       0.2  10090.000000              3
4  2019       ZH       0.8   2523.750000              4

In [21]:
#DataFrame as specialized dictionary
data = [{'a': i, 'b':50* i}for i in range(6)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 50}, {'a': 2, 'b': 100}, {'a': 3, 'b': 150}, {'a': 4, 'b': 200}, {'a': 5, 'b': 250}]

   a    b
0  0    0
1  1   50
2  2  100
3  3  150
4  4  200
5  5  250

In [22]:
pd.DataFrame([{'aa': 1, 'bb': 2}, {'bb': 3, 'cc': 6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [25]:
pd.DataFrame(np.random.randint(2, 18),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

   foo  bar
a   15   15
b   15   15
c   15   15

In [27]:
#The Pandas Index Object
ind = pd.Index([70, 54, 87, 17, 91, 8])
ind

Int64Index([70, 54, 87, 17, 91, 8], dtype='int64')

In [28]:
ind[1]

54

In [29]:
ind[5]

8

In [30]:
ind[::]

Int64Index([70, 54, 87, 17, 91, 8], dtype='int64')

In [31]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

6 (6,) 1 int64

In [32]:
ind[1] = 0

TypeError: Index does not support mutable operations

In [34]:
# Index Preservation
rng = np.random.RandomState(15)
ser = pd.Series(rng.randint(0, 10, 7))
ser

0    8
1    5
2    5
3    7
4    0
5    7
6    5
dtype: int32

In [35]:
dfr = pd.DataFrame(rng.randint(0, 10, (5, 4)),
                  columns=['A', 'B', 'C', 'D'])
dfr

   A  B  C  D
0  6  1  7  0
1  4  9  7  5
2  3  6  8  2
3  1  1  0  5
4  2  2  1  8

In [36]:
np.exp(ser)

0    2980.957987
1     148.413159
2     148.413159
3    1096.633158
4       1.000000
5    1096.633158
6     148.413159
dtype: float64

In [37]:
np.sin(dfr * np.pi / 4)

              A         B             C             D
0 -1.000000e+00  0.707107 -7.071068e-01  0.000000e+00
1  1.224647e-16  0.707107 -7.071068e-01 -7.071068e-01
2  7.071068e-01 -1.000000 -2.449294e-16  1.000000e+00
3  7.071068e-01  0.707107  0.000000e+00 -7.071068e-01
4  1.000000e+00  1.000000  7.071068e-01 -2.449294e-16

In [38]:
np.cos(dfr * np.pi / 4)

              A             B         C             D
0 -1.836970e-16  7.071068e-01  0.707107  1.000000e+00
1 -1.000000e+00  7.071068e-01  0.707107 -7.071068e-01
2 -7.071068e-01 -1.836970e-16  1.000000  6.123234e-17
3  7.071068e-01  7.071068e-01  1.000000 -7.071068e-01
4  6.123234e-17  6.123234e-17  0.707107  1.000000e+00

In [39]:
np.tan(dfr * np.pi / 5)

          A         B         C             D
0  0.726543  0.726543  3.077684  0.000000e+00
1 -0.726543 -0.726543  3.077684 -1.224647e-16
2 -3.077684  0.726543 -3.077684  3.077684e+00
3  0.726543  0.726543  0.000000 -1.224647e-16
4  3.077684  3.077684  0.726543 -3.077684e+00

In [40]:
#Index alignment in Series
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')
print(area)
population

Alaska        1723337
Texas          695662
California     423967
Name: area, dtype: int64

California    38332521
Texas         26448193
New York      19651127
Name: population, dtype: int64

In [41]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [42]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [43]:
A = pd.Series([22, 44, 66], index=[0, 1, 2])
B = pd.Series([11, 13, 15], index=[1, 2, 3])
print(A)
print(B)
B
A + B

0    22
1    44
2    66
dtype: int64
1    11
2    13
3    15
dtype: int64

0     NaN
1    55.0
2    79.0
3     NaN
dtype: float64

In [44]:
A.add(B, fill_value=0)

0    22.0
1    55.0
2    79.0
3    15.0
dtype: float64

In [45]:
#Merge operations
df

   Year Province  Literacy          Blah  Serie_aligned
0  2015       FL       0.3   6716.666667              0
1  2016       FL       0.5   4032.000000              1
2  2017       NH       0.6   3361.666667              2
3  2018       NH       0.2  10090.000000              3
4  2019       ZH       0.8   2523.750000              4

In [46]:
df2 = pd.DataFrame({"Province": ["FL", "NH", "ZH"], "Population": ["100000", "200000", "300000"]})
df2

  Province Population
0       FL     100000
1       NH     200000
2       ZH     300000

In [47]:
df.merge(df2)

   Year Province  Literacy          Blah  Serie_aligned Population
0  2015       FL       0.3   6716.666667              0     100000
1  2016       FL       0.5   4032.000000              1     100000
2  2017       NH       0.6   3361.666667              2     200000
3  2018       NH       0.2  10090.000000              3     200000
4  2019       ZH       0.8   2523.750000              4     300000

In [48]:
df3 = pd.DataFrame({"province": ["FL", "NH"], "Population": ["100000", "200000"]})
df3
df.merge(df3, right_on='province', left_on='Province')

   Year Province  Literacy          Blah  Serie_aligned province Population
0  2015       FL       0.3   6716.666667              0       FL     100000
1  2016       FL       0.5   4032.000000              1       FL     100000
2  2017       NH       0.6   3361.666667              2       NH     200000
3  2018       NH       0.2  10090.000000              3       NH     200000

In [49]:
df4 = pd.DataFrame({"Province": ["FL", "NH", "UT"], "Population": ["100000", "200000", "50000"]})
df.merge(df4, how='outer')

     Year Province  Literacy          Blah  Serie_aligned Population
0  2015.0       FL       0.3   6716.666667            0.0     100000
1  2016.0       FL       0.5   4032.000000            1.0     100000
2  2017.0       NH       0.6   3361.666667            2.0     200000
3  2018.0       NH       0.2  10090.000000            3.0     200000
4  2019.0       ZH       0.8   2523.750000            4.0        NaN
5     NaN       UT       NaN           NaN            NaN      50000

In [50]:
df5 = pd.DataFrame({"Province": ["FL", "NH", "FL"], "Population": ["100000", "200000", "50000"]})
print(df)
df.merge(df5, how='outer')

   Year Province  Literacy          Blah  Serie_aligned
0  2015       FL       0.3   6716.666667              0
1  2016       FL       0.5   4032.000000              1
2  2017       NH       0.6   3361.666667              2
3  2018       NH       0.2  10090.000000              3
4  2019       ZH       0.8   2523.750000              4

   Year Province  Literacy          Blah  Serie_aligned Population
0  2015       FL       0.3   6716.666667              0     100000
1  2015       FL       0.3   6716.666667              0      50000
2  2016       FL       0.5   4032.000000              1     100000
3  2016       FL       0.5   4032.000000              1      50000
4  2017       NH       0.6   3361.666667              2     200000
5  2018       NH       0.2  10090.000000              3     200000
6  2019       ZH       0.8   2523.750000              4        NaN

In [53]:
serie_a = pd.Series([np.nan, 12.55, np.nan, 23.75, 14.775, np.nan],
                     index=['f', 'e', 'd', 'c', 'b', 'a'])
serie_b = pd.Series(np.arange(len(serie_a), dtype=np.float64),
                 index=['f', 'e', 'd', 'c', 'b', 'a'])
serie_a

f       NaN
e    12.550
d       NaN
c    23.750
b    14.775
a       NaN
dtype: float64

In [54]:
serie_b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [55]:
pd.Series(np.where(pd.isnull(serie_a), serie_b, serie_a), index=serie_a.index)

f     0.000
e    12.550
d     2.000
c    23.750
b    14.775
a     5.000
dtype: float64

In [56]:
serie_a.combine_first(serie_b)

f     0.000
e    12.550
d     2.000
c    23.750
b    14.775
a     5.000
dtype: float64

In [57]:
serie_a.combine_first(serie_a)

f       NaN
e    12.550
d       NaN
c    23.750
b    14.775
a       NaN
dtype: float64